# 1. რიცხვების გაორმაგება
#    დაწერეთ lambda-ფუნქცია, რომელიც იღებს რიცხვს და აბრუნებს მის გაორმაგებულ მნიშვნელობას.  

double = lambda x: x * 2
print(double(30))  

# 2. სტრინგის სიგრძის გამოთვლა
#    დაწერეთ lambda-ფუნქცია, რომელიც იღებს სტრინგს და აბრუნებს მის სიმბოლოების რაოდენობას.  

string_length = lambda s: len(s)
print(string_length("print"))

# 3. კენტ და ლუწი რიცხვების ამოცნობა
#    დაწერეთ lambda-ფუნქცია, რომელიც ამოწმებს, რიცხვი კენტია თუ არა.  


is_odd = lambda x: x % 2 != 0
print(is_odd(5))  
print(is_odd(6))

# 4. რიცხვების კვადრატში აყვანა
#    დაწერეთ lambda-ფუნქცია, რომელიც იღებს რიცხვს და აბრუნებს მის კვადრატს.  

square = lambda x: x ** 2
print(square(5))
print(square(-1))

# 5. ლუწი რიცხვების კვადრატში აყვანა სიიდან
#    დაწერეთ ფუნქცია, რომელიც lambda-ფუნქციას გამოიყენებს, რათა სიიდან ლუწი რიცხვები ამოარჩიოს და თითოეული მათგანი კვადრატში აიყვანოს.

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
squared_evens = [x ** 2 for x in numbers if x % 2 == 0]
print(squared_evens)