# 1️⃣ 📜 შექმენი სია:
# შექმენით სია, რომელიც შეიცავს 10 ელემენტს, მაგალითად: ნივთები, სახელები ან რიცხვები. 🧩 აირჩიე 10 ისეთი რამ, რაც გინდა, რომ იყოს სიაში!

list =["vashli", 15, "barbare", 5.6, "wigni", "rveuli", "pica", "mobiluri", "leptopi", 50 ]
print(list)

# # 2️⃣ list = [17,2,3,4,10,6,100,8,9,11] 
# # მოცემულია სია რომელიც წერია არასწორად თქვენი დავალებაა რომ შეასწოროთ ის 


# # 3️⃣ 🔄 შემოიტანეთ რიცხვების სია და  დაბეჭდეთ ელემენტები მესამე და მეშვიდე ინდექს შორის

num = [2, 3, 4, 6, 8, 10, 15, 5]
    # 1   2  3  4  5   6   7  8
print(num[3:7])

# 4️⃣ 🏁 დაბეჭდეთ ბოლო სამი ელემენტი:
# თქვენი სიის ბოლო სამი ნივთი! 🌟 

list =["vashli", "barbare", "wigni", "rveuli", "pica", "mobiluri", "leptopi"]
print(list[-3:])

# 5️⃣ ამიხსენით list და indexing კომენატრებით 📝

# List-ები წარმოადგენს მონაცემთა ტიპს, რომელიც ინახავს ელემენტებს.

# indexing-ით შგვიძლია კონკრეტულ ელემეტს მივწვდეთ