# 1) შექმენით სია თქვენი საყვარელი ხილების შესახებ. შემდეგ გამოიყენეთ ინდექსინგი, რათა დაპრინტოთ სიის პირველი და ბოლო ელემენტები

# fruit = ["sazamtro", "nesvi", "vashli", "yurdzeni", "mandarini", "fortoxali"]
# print(fruit[0])
# print(fruit[-1])


# 2) შექმენით სია, სადაც გენქებათ რიცხვები 1-დან 10-ის ჩათვლის, შემდგომ კი დაპრინტეთ სიის პირველი, მეხუთე და მეათე ელემენტები

# number = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# print(number[0])
# print(number[4])
# print(number[-1])


# 3) შექმენით სია, სადაც მოთავსებული იქნება ოთხი სახეობის ცხოველი. შემდეგ შეცვალეთ სიის პირველი ელემენტი "ლომი"-ით და დაბეჭდეთ განახლებული სია

# animals = ["kata", "dzagli", "cxeni", "vefxvi"]
# animals[0] = "lomi"
# print(animals)


# 4) შექმენით სია თქვენი საყვარელი ფილმების შესახებ, რომელიც შესდგება მინიმუმ 4 ელემენტით. გამოიყენეთ მინუს ინდექსი, რათა დაპრინტოთ სიის ბოლო ელემენტი


# film = ["fight_club", "corpse_bride", "the notebook", "hobs & show"]
# print(film[-1])

# 5) შექმენით სია ნებისმიერი ციფრებით, მაგალითად [10, 20, 30, 40, 50, 60]. შემდეგ გამოიყენეთ მინუს ინდექსი, რათა დაბეჭდოთ სიის უკანასკნელი ორი ელემენტი

number =[10, 20, 30, 40, 50, 60]
print(number[-2:])



