# დავალება 1
# შექმენით სია list_of_names, რომელშიც ინახება სახელები. დაწერეთ კოდი, რომელიც ითვლის, რამდენჯერ მეორდება კონკრეტული სახელი (მაგალითად, "დავით") სიაში.

list_of_name = ["mate","barbare","kristine","luka","mate"]
name = list_of_name.count("mate")
print(name)


# დავალება 2
# შექმენით სია, რომელშიც ინახება რიცხვები. დაწერეთ კოდი, რომელიც ამ სიის რიცხვებს გადაატრიალებს უკუღმა reverse მეთოდის გამოყენებით და 
# დაბეჭდეთ შედეგი..

# x = [2, 5, 6, 7, 9, 2, 1,]
# print(x[::-1])

# დავალება 3:
# შექმენით სია list_of_numbers, დაამატეთ მასში რამდენიმე რიცხვი და დაწერეთ კოდი, რომელიც ამ რიცხვებს სიის სიგრძის მიხედვით მრავალჯერ გამოიტანს  იგიევე ციფრებს.
# მაგალითად, თუ სიის სიგრძე არის 3 და სია ასეთია: [1, 2, 3], საბოლოოდ უნდა მივიღოთ: [1, 2, 3, 1, 2, 3, 1, 2, 3].

# list_of_numbers = [1, 2, 3, 4, 5,]
# list_of_numbers *= 3
# print(list_of_numbers)

# დავალება 4
# შექმენით პროგრამიერების ენის სია insert_arr. შემდეგ დაამატეთ კონკრეტული ელემენტი (მაგალითად, "დავითი") კონკრეტულ ინდექსზე insert მეთოდის გამოყენებით. დაბეჭდეთ განახლებული სია.

# insert_arr = ["შავლეგო","მახათი","გიტარა"]
# insert_arr += ["პიანინო"]
# print(insert_arr)

# დავალება 5
# შექმენით სია, იპოვეთ კონკრეტული ელემენტის რაოდენობა count მეთოდის გამოყენებით და ამოიღეთ ეს ელემენტი სიიდან remove მეთოდით. დაბეჭდეთ ელემენტის რაოდენობა და განახლებული სია.

# x = [1, 2, 3, 4, 4, 5, 6, 7, 8, 9, 10]
# print(x.count(5))
# x.remove(4)
# print(x)
